# SECURITIES INCOME STATEMENT

Library

In [2]:
# Import libraries
import pandas as pd
import numpy as np
import datetime as dt

Symbol

In [3]:
# Save as a table
sql_symbol = pd.read_csv("symbol_id.csv")
sql_symbol.drop(['Unnamed: 0'], axis=1, inplace=True)

# Save as a dict
dict_sql_symbol = dict(zip(sql_symbol['SymbolID'], sql_symbol['Symbol']))

Pathlink

In [4]:
# Assign pathlink
algo_pathlink = r"/Users/rainmeteror/Desktop/BSC_Algo_Database_UAT/OneDrive_1_5-29-2023/securities/algo_sis.xlsx"
sql_pathlink = r"/Users/rainmeteror/Desktop/BSC_Algo_Database_UAT/OneDrive_1_5-29-2023/securities/sql_sis.xlsx"
same_field_data = r"/Users/rainmeteror/Desktop/BSC_Algo_Database_UAT/OneDrive_1_5-29-2023/securities/sis_datafield.xlsx"

Algo Database

In [5]:
# Read data from algo database
df_algo = pd.read_excel(algo_pathlink)
df_algo.drop(['Unnamed: 0', 'SCN', 'REPORTED_DATE', 'AUDITED', 'MONTH_IN_PERIOD', 'CREATED_DATE', 'UPDATED_DATE'], axis=1, inplace=True)
df_algo = df_algo.loc[df_algo['FREQ_CODE'] != 'Y']
df_algo['YEAR'] = df_algo['REPORT_DATE'].dt.year
df_algo['QUARTER'] = df_algo['REPORT_DATE'].dt.quarter
df_algo.drop(['REPORT_DATE', 'FREQ_CODE'], axis=1, inplace=True)

# Sort Values
df_algo.sort_values(by=['YEAR', 'QUARTER', 'SECURITY_CODE'], ascending=[True, True, True], inplace=True)

# Print how many rows are used
print("ALGO DATABASE SECURITIES: There are: " + str(len(df_algo)) + " rows")
print("ALGO DATABASE SECURITIES: There are: " + str(len(df_algo.columns)) + " columns")

ALGO DATABASE SECURITIES: There are: 1015 rows
ALGO DATABASE SECURITIES: There are: 90 columns

In [6]:
df_algo['SIS_7_1'] = df_algo['SIS_7_1'] + df_algo['SIS_7_2']

In [7]:
df_algo.head(1)

,SECURITY_CODE,SIS_20,SIS_1,SIS_1_1,SIS_1_2,SIS_1_3,SIS_2,SIS_3,SIS_4,SIS_5,...,SIS_401,SIS_402,SIS_500,SIS_501,SIS_502,SIS_1_4,SIS_21_4,SIS_300,YEAR,QUARTER
362,AAS,NaN,35548163137,9546893708,0,26001269429,3303165875,1229748711,0,0,...,7478373690,0,0,0.0,0.0,NaN,NaN,NaN,2020,1

Stockbiz Database

In [8]:
# Read data from sql database
df_sql = pd.read_excel(sql_pathlink)
df_sql.drop(['Unnamed: 0', 'ReportID', 'LastUpdated', 'ApprovedBy', 'CreatedBy', 'LastUpdatedBy',
             'ReportStatus', 'AssignedTo', 'CreatedAt'], axis=1, inplace=True)
df_sql = df_sql.loc[(df_sql['Quarter'] != 0) & (df_sql['Year'] > 2019)]
df_sql.sort_values(by=['Year', 'Quarter'], ascending=[True, True], inplace=True)

# Change the name of tickers
df_sql['SymbolID'] = df_sql['SymbolID'].map(dict_sql_symbol)

# Change the name of column SymbolID
df_sql.rename(
    columns={"SymbolID": "SECURITY_CODE",
             "Year": "YEAR",
             "Quarter": "QUARTER"},
    inplace=True
)

# Print how many rows are used
print("STOCKBIZ DATABASE SECURITIES: There are: " + str(len(df_sql)) + " rows")
print("STOCKBIZ DATABASE SECURITIES: There are: " + str(len(df_sql.columns)) + " rows")

STOCKBIZ DATABASE SECURITIES: There are: 450 rows
STOCKBIZ DATABASE SECURITIES: There are: 76 rows

In [9]:
df_sql.head(1)

,SECURITY_CODE,QUARTER,YEAR,F2,F3,F4,F5,F6,F7,F8,...,F65,F66,F67,F68,F69,F70,F71,F72,F73,F74
3,SSI,1,2020,1.964231e+11,8.039438e+10,5.827895e+10,5.774981e+10,2.589635e+11,1.454985e+11,1.594694e+11,...,0.0,0.0,0.0,0.0,-2.394768e+11,-2.394768e+11,0.0,NaN,NaN,NaN

In [10]:
# Get Symbol in insurance sectors
securities_symbol = df_sql['SECURITY_CODE'].unique()

In [11]:
print("There are: "+ str(len(securities_symbol))+ " stocks")

There are: 36 stocks

Process 2 tables

In [12]:
# Change the name of columns
same_column_name = pd.read_excel(same_field_data)
same_column_name.dropna(axis=0, inplace=True)

# Create a dict with key from bbs_sql and value from bbs_algo
dict_column_name = dict(zip(same_column_name['sis_sql'], same_column_name['sis_algo']))

In [13]:
same_column_name

   sis_algo sis_sql
0    SIS_20     F16
1     SIS_1      F2
2   SIS_1_1      F3
3   SIS_1_2      F4
4   SIS_1_3      F5
..      ...     ...
76  SIS_306     F67
77  SIS_307     F68
78  SIS_400     F69
79  SIS_401     F70
80  SIS_402     F71

[69 rows x 2 columns]

In [14]:
df_sql.columns

Index(['SECURITY_CODE', 'QUARTER', 'YEAR', 'F2', 'F3', 'F4', 'F5', 'F6', 'F7',
       'F8', 'F9', 'F10', 'F11', 'F12', 'F13', 'F14', 'F15', 'F16', 'F17',
       'F18', 'F19', 'F20', 'F21', 'F22', 'F23', 'F24', 'F25', 'F26', 'F27',
       'F28', 'F29', 'F30', 'F31', 'F32', 'F33', 'F34', 'F35', 'F36', 'F37',
       'F38', 'F39', 'F40', 'F41', 'F42', 'F43', 'F44', 'F45', 'F46', 'F47',
       'F48', 'F49', 'F50', 'F51', 'F52', 'F53', 'F54', 'F55', 'F56', 'F57',
       'F58', 'F59', 'F60', 'F61', 'F62', 'F63', 'F64', 'F65', 'F66', 'F67',
       'F68', 'F69', 'F70', 'F71', 'F72', 'F73', 'F74'],
      dtype='object')

In [15]:
# Change the name of df_sql based on name of the similar data field in df_algo
df_sql.rename(
    columns=dict_column_name,
    inplace=True
)

# Fill NA values in df_sql
df_sql = df_sql.fillna(0)

# Change the type of data which is same between two tables
df_sql[same_column_name['sis_algo']] = df_sql[same_column_name['sis_algo']].astype('Int64')

In [16]:
# Change the type of data in df_algo
# Just get the same data between two tables
df_algo[same_column_name['sis_algo']] = df_algo[same_column_name['sis_algo']].astype('Int64')

# Change the type of YEAR and QUARTER
df_algo =  df_algo.astype(
    {"YEAR": "Int64",
     "QUARTER": "Int64"},
)

# Get the data with same value in banking sector
df_algo = df_algo.loc[df_algo['SECURITY_CODE'].isin(securities_symbol)]

In [17]:
# Get the final same columns
final_column = ["SECURITY_CODE", "YEAR", "QUARTER"]

for i in same_column_name['sis_algo']:
    final_column.append(i)

In [18]:
df_sql = df_sql[final_column]
df_algo = df_algo[final_column]

In [19]:
def compare_table(df1, df2, columns) -> pd.DataFrame():
    
    return pd.merge(df1, df2, on=columns, how='outer', indicator=True).query("_merge != 'both'")

In [20]:
final_result = {"field": [], "value_not_same": []}
for i in range(3, len(final_column)):
    check_columns = ["SECURITY_CODE", 'YEAR', 'QUARTER', final_column[i]]
    result = compare_table(
        df1=df_sql[check_columns], 
        df2=df_algo[check_columns], 
        columns=check_columns)
    
    value_not_same = len(result)/(len(df_algo) + len(df_sql))*100
    
    final_result["field"].append(final_column[i])
    final_result["value_not_same"].append(value_not_same)

In [21]:
pd.DataFrame(final_result).to_excel("check_sis.xlsx")